---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartMaterialThickness
source: html/f9a704b1-f17a-badd-4dbf-3c23cbe3cd90.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartMaterialThickness Property

"Part Material Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartMaterialThickness { get; }
```